Revit 2024 API
KeyBasedTreeEntry Members
The KeyBasedTreeEntry type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the KeyBasedTreeEntry
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetChildrenKeys
 Gets a collection containing the keys of all children entry objects from this entry.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Key
 The key of this entry.
ParentKey
 The parent key of this entry.
See Also
KeyBasedTreeEntry Class
Autodesk.Revit.DB Namespace